name: "resnet50_embed"
platform: "tensorrt_plan"
max_batch_size: 1024

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, 224, 224]
  }
]

output [
  {
    name: "embedding"
    data_type: TYPE_FP32
    dims: [2048]
  }
]