name: "preprocessor_dino"
backend: "python"
max_batch_size: 4096
input [
  {
    name: "image_id"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name: "preprocessed_image"
    data_type: TYPE_FP32
    dims: [3, 224, 224] 
  }
]
instance_group [
  {
    kind: KIND_GPU
  }
]


dynamic_batching {
  preferred_batch_size: [32, 64, 128, 256, 512, 1024]
  max_queue_delay_microseconds: 100
}