name: "resnet50"
platform: "tensorflow_savedmodel"
max_batch_size: 32

input [
  {
    name: "input_1"
    data_type: TYPE_FP32
    format: FORMAT_NHWC
    dims: [224, 224, 3]
  }
]

output [
  {
    name: "activation_49"
    data_type: TYPE_FP32
    dims: [1001]
  }
]