name: "ensemble_model_resnet"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "image_id"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "classification_output"
    data_type: TYPE_FP32
    dims: [1001]  # ResNet50 output is 1001 classes
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocessor_resnet"
      model_version: -1
      input_map {
        key: "image_id"
        value: "image_id"
      }
      output_map {
        key: "preprocessed_image"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "resnet50"
      model_version: -1
      input_map {
        key: "input_1"
        value: "preprocessed_image"
      }
      output_map {
        key: "activation_49"
        value: "classification_output"
      }
    }
  ]
}
